tutorials/suspensionFlows/oilWaxFoam/axialsimmetric/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
(0 0 0)
(8.25 0.288 0)
(8.25 0.288 165)
(0 0 165)
(8.25 -0.288 0)
(8.25 -0.288 165)
);

blocks
(
hex (0 4 1 0 3 5 2 3) (30  2 100)simpleGrading
(

    (
        //(0.05 0.3 4)    // 20% y-dir, 30% cells, expansion = 4
        (0.7 0.6 1)    // 60% y-dir, 40% cells, expansion = 1
        (0.05 0.4 0.05) // 20% y-dir, 30% cells, expansion = 0.25 (1/4)
    )
    1                 // y-direction expansion ratio
    1                 // z-direction expansion ratio
)
);

edges
(
);

boundary
(
     front
     {
           type wedge;
           faces
           (
               (0 1 2 3)
           );
      }
     back
     {
           type wedge;
           faces
           (
               (0 3 5 4)
           );
      }
     walls
     {
           type wall;
           faces
           (
               (1 4 5 2)
           );
      }
     inlet
     {
           type patch;
           faces
           (
               (0 4 1 0)
           );
      }
     outlet
     {
           type patch;
           faces
           (
               (3 5 2 3)
           );
      }
     axis
     {
           type empty;
           faces
           (
               (0 3 3 0)
           );
      }
);

mergePatchPairs
(
);
