tutorials/suspensionFlows/oilWaxFoam/axialsimmetric/0/psi.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;

    }

    outlet
    {
        type            zeroGradient;


    }

    walls
    {
        type            zeroGradient;
    }
    axis
    {
      type              empty;
    }
    front
    {
      type            wedge;
      value           zeroGradient;
    }
    back
    {
      type            wedge;
      value           zeroGradient;
    }

}
