tutorials/suspensionFlows/oilWaxFoam/axialsimmetric/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type      vectorSemiImplicitSource;

//    timeStart       0.0;
//    duration        1000;
    selectionMode   all;

    volumeMode      specific;
    injectionRateSuSp
    {
        U    (( 0 0 1e3 ) 0);
    }
}


// ************************************************************************* //
